Revit 2027 API
ParameterTypeId.StairsRuntypeStructuralDepth Property
 "Structural Depth": Structural Depth
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId StairsRuntypeStructuralDepth { get; }
Public Shared ReadOnly Property StairsRuntypeStructuralDepth As ForgeTypeId
	Get
public:
static property ForgeTypeId^ StairsRuntypeStructuralDepth {
	ForgeTypeId^ get ();
}
static member StairsRuntypeStructuralDepth : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace